In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import sqlalchemy as db
import getpass

In [8]:
# We noticed the data doesn't have column names, so we'll read it without adding
# headers and add the column names afterwards

data = pd.read_csv('creditcardmarketing.csv', header=None)
data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16
0,1,No,Air Miles,Letter,High,1,No,High,2,1,4,No,1160.75,1669.0,877.0,1095.0,1002.0
1,2,No,Air Miles,Letter,Medium,1,No,Medium,2,2,5,Yes,147.25,39.0,106.0,78.0,366.0
2,3,No,Air Miles,Postcard,High,2,No,Medium,2,1,2,Yes,276.50,367.0,352.0,145.0,242.0
3,4,No,Air Miles,Letter,Medium,2,No,High,1,1,4,No,1219.00,1578.0,1760.0,1119.0,419.0
4,5,No,Air Miles,Letter,Medium,1,No,Medium,2,1,6,Yes,1211.00,2140.0,1357.0,982.0,365.0

In [11]:
columns = ['customer_number', 'offer_accepted', 'reward', 'mailer_type', \
    'income_level', 'bank_accounts_open', 'overdraft_protection', \
    'credit_rating', 'credit_cards_held', 'homes_owned', 'household_size', \
    'home_owner', 'average_balance', 'balance_Q1', 'balance_Q2', 'balance_Q3', \
    'balance_Q4']

data.columns = columns

In [17]:
data.to_csv('creditcardmarketing_with_headers.csv', index=False)

### Instructions

#### 1. Create a database called `credit_card_classification`

In [24]:
password = getpass.getpass('Get password')

connection_string = 'mysql+pymysql://root:' + password + '@localhost/credit_card_classification'
engine = db.create_engine(connection_string, echo=True)
# The credit_card_classification schema was created in MySQL Workbench, so next line is commented out
# engine.execute("CREATE DATABASE IF NOT EXISTS credit_card_classification")
# engine.execute("USE credit_card_classification")
metadata = db.MetaData()
conn = engine.connect()

2022-04-02 13:39:58,538 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2022-04-02 13:39:58,539 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-04-02 13:39:58,541 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2022-04-02 13:39:58,542 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-04-02 13:39:58,543 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2022-04-02 13:39:58,544 INFO sqlalchemy.engine.Engine [raw sql] {}

#### 2. Create a table `credit_card_data` with the same columns as given in the csv file. Please make sure you use the correct data types for each of the columns.

In [19]:
credit_card_data = db.Table('credit_card_data', metadata,
                    db.Column('customer_number', db.Integer()),
                    db.Column('offer_accepted', db.String(255), nullable=False),
                    db.Column('reward', db.String(255), nullable=False),
                    db.Column('mailer_type', db.String(255), nullable=False),
                    db.Column('income_level', db.String(255), nullable=False),
                    db.Column('bank_accounts_open', db.Integer()),
                    db.Column('overdraft_protection', db.String(255), nullable=False),
                    db.Column('credit_rating', db.String(255), nullable=False),
                    db.Column('credit_cards_held', db.Integer()),
                    db.Column('homes_owned', db.Integer()),
                    db.Column('household_size', db.Integer()),                   
                    db.Column('home_owner', db.String(255), nullable=False),
                    db.Column('average_balance', db.Float()),                   
                    db.Column('balance_Q1', db.Float()),                   
                    db.Column('balance_Q2', db.Float()),                   
                    db.Column('balance_Q3', db.Float()),                   
                    db.Column('balance_Q4', db.Float())                   
              )

metadata.create_all(engine)

In [20]:
data = pd.read_sql_query("SELECT * FROM credit_card_data", engine)
data.columns

Index(['customer_number', 'offer_accepted', 'reward', 'mailer_type',
       'income_level', 'bank_accounts_open', 'overdraft_protection',
       'credit_rating', 'credit_cards_held', 'homes_owned', 'household_size',
       'home_owner', 'average_balance', 'balance_Q1', 'balance_Q2',
       'balance_Q3', 'balance_Q4'],
      dtype='object')

#### 3. Import the data from the csv file into the table. Before you import the data into the empty table, make sure that you have deleted the headers from the csv file. To not modify the original data, if you want you can create a copy of the csv file as well. Note you might have to use the following queries to give permission to SQL to import data from csv files in bulk:

```sql
SHOW VARIABLES LIKE 'local_infile'; -- This query would show you the status of the variable ‘local_infile’. If it is off, use the next command, otherwise you should be good to go

SET GLOBAL local_infile = 1;
```

In [21]:
# This was done in SQL Workbench using the import table option

#### 4.  Select all the data from table `credit_card_data` to check if the data was imported correctly.

In [64]:
query = "SELECT * FROM credit_card_data"
data = pd.read_sql_query(query, engine)
data.head()

2022-04-02 16:15:38,072 INFO sqlalchemy.engine.Engine SELECT * FROM credit_card_data
2022-04-02 16:15:38,073 INFO sqlalchemy.engine.Engine [raw sql] {}

,customer_number,offer_accepted,reward,mailer_type,income_level,bank_accounts_open,overdraft_protection,credit_rating,credit_cards_held,homes_owned,household_size,home_owner,average_balance,balance_Q1,balance_Q2,balance_Q3
0,1,No,Air Miles,Letter,High,1,No,High,2,1,4,No,1160.75,1669.0,877.0,1095.0
1,2,No,Air Miles,Letter,Medium,1,No,Medium,2,2,5,Yes,147.25,39.0,106.0,78.0
2,3,No,Air Miles,Postcard,High,2,No,Medium,2,1,2,Yes,276.50,367.0,352.0,145.0
3,4,No,Air Miles,Letter,Medium,2,No,High,1,1,4,No,1219.00,1578.0,1760.0,1119.0
4,5,No,Air Miles,Letter,Medium,1,No,Medium,2,1,6,Yes,1211.00,2140.0,1357.0,982.0

#### 5.  Use the _alter table_ command to drop the column `q4_balance` from the database, as we would not use it in the analysis with SQL. Select all the data from the table to verify if the command worked. Limit your returned results to 10.

In [25]:
query = "ALTER TABLE credit_card_data DROP COLUMN balance_Q4"
conn.execute(query)

2022-04-02 13:44:27,960 INFO sqlalchemy.engine.Engine ALTER TABLE credit_card_data DROP COLUMN balance_Q4
2022-04-02 13:44:27,961 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-04-02 13:44:28,238 INFO sqlalchemy.engine.Engine COMMIT

In [26]:
query = "SELECT * FROM credit_card_data LIMIT 10"
top_ten = pd.read_sql_query(query, engine)
top_ten.head()

2022-04-02 13:44:34,383 INFO sqlalchemy.engine.Engine SELECT * FROM credit_card_data LIMIT 10
2022-04-02 13:44:34,384 INFO sqlalchemy.engine.Engine [raw sql] {}

,customer_number,offer_accepted,reward,mailer_type,income_level,bank_accounts_open,overdraft_protection,credit_rating,credit_cards_held,homes_owned,household_size,home_owner,average_balance,balance_Q1,balance_Q2,balance_Q3
0,1,No,Air Miles,Letter,High,1,No,High,2,1,4,No,1160.75,1669.0,877.0,1095.0
1,2,No,Air Miles,Letter,Medium,1,No,Medium,2,2,5,Yes,147.25,39.0,106.0,78.0
2,3,No,Air Miles,Postcard,High,2,No,Medium,2,1,2,Yes,276.50,367.0,352.0,145.0
3,4,No,Air Miles,Letter,Medium,2,No,High,1,1,4,No,1219.00,1578.0,1760.0,1119.0
4,5,No,Air Miles,Letter,Medium,1,No,Medium,2,1,6,Yes,1211.00,2140.0,1357.0,982.0

#### 6.  Use sql query to find how many rows of data you have.

In [28]:
query = '''SELECT COUNT(*) AS number_of_rows 
           FROM credit_card_data'''
           
rows = pd.read_sql_query(query, engine)
print(rows)

2022-04-02 13:48:51,342 INFO sqlalchemy.engine.Engine SELECT COUNT(*) AS number_of_rows FROM credit_card_data
2022-04-02 13:48:51,343 INFO sqlalchemy.engine.Engine [raw sql] {}
   number_of_rows
0           18000

#### 7.  Now we will try to find the unique values in some of the categorical columns:

    - What are the unique values in the column `Offer_accepted`?

In [29]:
query = '''SELECT DISTINCT offer_accepted 
           FROM credit_card_data'''
           
unique_values = pd.read_sql_query(query, engine)
print(unique_values)

2022-04-02 13:49:56,593 INFO sqlalchemy.engine.Engine SELECT DISTINCT offer_accepted
           FROM credit_card_data
2022-04-02 13:49:56,594 INFO sqlalchemy.engine.Engine [raw sql] {}
  offer_accepted
0             No
1            Yes

    - What are the unique values in the column `Reward`?

In [30]:
query = '''SELECT DISTINCT reward 
           FROM credit_card_data'''
           
unique_values = pd.read_sql_query(query, engine)
print(unique_values)

2022-04-02 13:50:12,174 INFO sqlalchemy.engine.Engine SELECT DISTINCT reward
           FROM credit_card_data
2022-04-02 13:50:12,175 INFO sqlalchemy.engine.Engine [raw sql] {}
      reward
0  Air Miles
1  Cash Back
2     Points

    - What are the unique values in the column `mailer_type`?

In [31]:
query = '''SELECT DISTINCT mailer_type 
           FROM credit_card_data'''
           
unique_values = pd.read_sql_query(query, engine)
print(unique_values)

2022-04-02 13:50:25,005 INFO sqlalchemy.engine.Engine SELECT DISTINCT mailer_type
           FROM credit_card_data
2022-04-02 13:50:25,007 INFO sqlalchemy.engine.Engine [raw sql] {}
  mailer_type
0      Letter
1    Postcard

    - What are the unique values in the column `credit_cards_held`?

In [32]:
query = '''SELECT DISTINCT credit_cards_held 
           FROM credit_card_data'''
           
unique_values = pd.read_sql_query(query, engine)
print(unique_values)

2022-04-02 13:50:56,353 INFO sqlalchemy.engine.Engine SELECT DISTINCT credit_cards_held
           FROM credit_card_data
2022-04-02 13:50:56,355 INFO sqlalchemy.engine.Engine [raw sql] {}
   credit_cards_held
0                  2
1                  1
2                  3
3                  4

    - What are the unique values in the column `household_size`?

In [45]:
query = '''SELECT DISTINCT household_size 
           FROM credit_card_data'''
           
unique_values = pd.read_sql_query(query, engine)
print(unique_values)

2022-04-02 15:07:36,119 INFO sqlalchemy.engine.Engine SELECT DISTINCT household_size
           FROM credit_card_data
2022-04-02 15:07:36,120 INFO sqlalchemy.engine.Engine [raw sql] {}
   household_size
0               4
1               5
2               2
3               6
4               3
5               1
6               8
7               9

#### 8.  Arrange the data in a decreasing order by the `average_balance` of the house. Return only the `customer_number` of the top 10 customers with the highest `average_balances` in your data.

In [47]:
query = '''SELECT customer_number
FROM credit_card_data
ORDER BY average_balance DESC
LIMIT 10'''

customers = pd.read_sql_query(query, engine)
print(customers)

2022-04-02 15:09:52,643 INFO sqlalchemy.engine.Engine SELECT customer_number
FROM credit_card_data
ORDER BY average_balance DESC
LIMIT 10
2022-04-02 15:09:52,644 INFO sqlalchemy.engine.Engine [raw sql] {}
   customer_number
0             2297
1            12636
2             8888
3            10577
4            14004
5            10476
6             2656
7            15260
8            15609
9             8778

#### 9.  What is the average balance of all the customers in your data?

In [48]:
query = '''SELECT ROUND(AVG(average_balance), 1) AS average_balance
FROM credit_card_data'''

avg_balance = pd.read_sql_query(query, engine)
print(avg_balance)

2022-04-02 15:11:07,227 INFO sqlalchemy.engine.Engine SELECT ROUND(AVG(average_balance), 1) AS average_balance
FROM credit_card_data
2022-04-02 15:11:07,228 INFO sqlalchemy.engine.Engine [raw sql] {}
   average_balance
0            939.3

#### 10. In this exercise we will use simple group by to check the properties of some of the categorical variables in our data. Note wherever `average_balance` is asked, please take the average of the column `average_balance`: 

    - What is the average balance of the customers grouped by `Income Level`? The returned result should have only two columns, income level and `Average balance` of the customers. Use an alias to change the name of the second column.

In [51]:
query = '''SELECT income_level, ROUND(AVG(average_balance), 1) AS avg_balance
FROM credit_card_data
GROUP BY income_level'''

avg_balance_per_income = pd.read_sql_query(query, engine)
print(avg_balance_per_income)

2022-04-02 15:44:26,184 INFO sqlalchemy.engine.Engine SELECT income_level, ROUND(AVG(average_balance), 1) AS avg_balance
FROM credit_card_data
GROUP BY income_level
2022-04-02 15:44:26,186 INFO sqlalchemy.engine.Engine [raw sql] {}
  income_level  avg_balance
0         High        941.1
1       Medium        939.7
2          Low        936.4

    - What is the average balance of the customers grouped by `number_of_bank_accounts_open`? The returned result should have only two columns, `number_of_bank_accounts_open` and `Average balance` of the customers. Use an alias to change the name of the second column.

In [52]:
query = '''SELECT bank_accounts_open, ROUND(AVG(average_balance), 1) AS avg_balance
FROM credit_card_data
GROUP BY bank_accounts_open'''

avg_balance_per_bank_accounts = pd.read_sql_query(query, engine)
print(avg_balance_per_bank_accounts)

2022-04-02 15:45:57,615 INFO sqlalchemy.engine.Engine SELECT bank_accounts_open, ROUND(AVG(average_balance), 1) AS avg_balance
FROM credit_card_data
GROUP BY bank_accounts_open
2022-04-02 15:45:57,616 INFO sqlalchemy.engine.Engine [raw sql] {}
   bank_accounts_open  avg_balance
0                   1        940.3
1                   2        935.3
2                   3        945.1

    - What is the average number of credit cards held by customers for each of the credit card ratings? The returned result should have only two columns, rating and average number of credit cards held. Use an alias to change the name of the second column.

In [55]:
query = '''SELECT credit_rating, ROUND(AVG(credit_cards_held), 1) AS avg_number_of_cards
FROM credit_card_data
GROUP BY credit_rating'''

avg_balance_per_credit_rating = pd.read_sql_query(query, engine)
print(avg_balance_per_credit_rating)

2022-04-02 15:51:45,737 INFO sqlalchemy.engine.Engine SELECT credit_rating, ROUND(AVG(credit_cards_held), 1) AS avg_number_of_cards
FROM credit_card_data
GROUP BY credit_rating
2022-04-02 15:51:45,738 INFO sqlalchemy.engine.Engine [raw sql] {}
  credit_rating  avg_number_of_cards
0          High                  1.9
1        Medium                  1.9
2           Low                  1.9

    - Is there any correlation between the columns `credit_cards_held` and `number_of_bank_accounts_open`? You can analyse this by grouping the data by one of the variables and then aggregating the results of the other column. Visually check if there is a positive correlation or negative correlation or no correlation between the variables.

In [56]:
query = '''SELECT bank_accounts_open, ROUND(AVG(credit_cards_held), 1) AS avg_number_of_cards
FROM credit_card_data
GROUP BY bank_accounts_open'''

cc_held_per_bank_accounts_open = pd.read_sql_query(query, engine)
print(cc_held_per_bank_accounts_open)

2022-04-02 16:03:14,471 INFO sqlalchemy.engine.Engine SELECT bank_accounts_open, ROUND(AVG(credit_cards_held), 1) AS avg_number_of_cards
FROM credit_card_data
GROUP BY bank_accounts_open
2022-04-02 16:03:14,472 INFO sqlalchemy.engine.Engine [raw sql] {}
   bank_accounts_open  avg_number_of_cards
0                   1                  1.9
1                   2                  1.9
2                   3                  1.9

#### 11. Your managers are only interested in the customers with the following properties:

    - Credit rating medium or high
    - Credit cards held 2 or less
    - Owns their own home
    - Household size 3 or more

For the rest of the things, they are not too concerned. Write a simple query to find what are the options available for them? Can you filter the customers who accepted the offers here?

In [58]:
query = '''SELECT *
FROM credit_card_data
WHERE (credit_rating = 'Medium' OR credit_rating = 'High') AND
credit_cards_held <= 2 AND
home_owner = 'Yes' AND 
household_size >= 3
'''

relevant_data = pd.read_sql_query(query, engine)
relevant_data.head()

2022-04-02 16:08:40,130 INFO sqlalchemy.engine.Engine SELECT *
FROM credit_card_data
WHERE (credit_rating = 'Medium' OR credit_rating = 'High') AND
credit_cards_held <= 2 AND
home_owner = 'Yes' AND
household_size >= 3

2022-04-02 16:08:40,131 INFO sqlalchemy.engine.Engine [raw sql] {}

,customer_number,offer_accepted,reward,mailer_type,income_level,bank_accounts_open,overdraft_protection,credit_rating,credit_cards_held,homes_owned,household_size,home_owner,average_balance,balance_Q1,balance_Q2,balance_Q3
0,2,No,Air Miles,Letter,Medium,1,No,Medium,2,2,5,Yes,147.25,39.0,106.0,78.0
1,5,No,Air Miles,Letter,Medium,1,No,Medium,2,1,6,Yes,1211.00,2140.0,1357.0,982.0
2,17,No,Points,Postcard,Low,2,No,Medium,1,1,4,Yes,1217.00,567.0,1161.0,966.0
3,18,No,Air Miles,Postcard,Low,2,No,High,2,1,4,Yes,1185.25,272.0,1523.0,2042.0
4,20,No,Cash Back,Letter,Medium,1,No,High,2,1,5,Yes,1086.75,764.0,997.0,921.0

#### 12. Your managers want to find out the list of customers whose average balance is less than the average balance of all the customers in the database. Write a query to show them the list of such customers. You might need to use a subquery for this problem.

In [61]:
query = '''SELECT customer_number, average_balance
FROM credit_card_data
WHERE average_balance < (SELECT AVG(average_balance) FROM credit_card_data)'''

lower_than_avg = pd.read_sql_query(query, engine)

# Check the filtering worked correctly
max(lower_than_avg.average_balance)

2022-04-02 16:12:06,646 INFO sqlalchemy.engine.Engine SELECT customer_number, average_balance
FROM credit_card_data
WHERE average_balance < (SELECT AVG(average_balance) FROM credit_card_data)
2022-04-02 16:12:06,647 INFO sqlalchemy.engine.Engine [raw sql] {}

939.25

#### 13. Since this is something that the senior management is regularly interested in, create a view of the same query.

In [62]:
query = '''CREATE VIEW low_balance_customers AS
SELECT customer_number, average_balance
FROM credit_card_data
WHERE average_balance < (SELECT AVG(average_balance) FROM credit_card_data)'''

#### 14. What is the number of people who accepted the offer vs number of people who did not?

In [70]:
rejected = data.offer_accepted.value_counts().loc['No']
accepted = data.offer_accepted.value_counts().loc['Yes']

print(rejected, "clients rejected the offer")
print(accepted, "clients accepted the offer")

16977 clients rejected the offer
1023 clients accepted the offer

#### 15. Your managers are more interested in customers with a credit rating of high or medium. What is the difference in average balances of the customers with high credit card rating and low credit card rating?

In [71]:
query = '''SELECT credit_rating, ROUND(AVG(average_balance), 1) AS avg_balance
FROM credit_card_data
WHERE credit_rating = 'High' OR credit_rating = 'Low' 
GROUP BY credit_rating'''

avg_balance_per_rating = pd.read_sql_query(query, engine)
print(avg_balance_per_rating)

2022-04-02 16:24:58,410 INFO sqlalchemy.engine.Engine SELECT credit_rating, ROUND(AVG(average_balance), 1) AS avg_balance
FROM credit_card_data
WHERE credit_rating = 'High' OR credit_rating = 'Low'
GROUP BY credit_rating
2022-04-02 16:24:58,411 INFO sqlalchemy.engine.Engine [raw sql] {}
  credit_rating  avg_balance
0          High        943.3
1           Low        938.9

In [76]:
difference = avg_balance_per_rating.iloc[0, 1] - \
    avg_balance_per_rating.iloc[1, 1]

print(round(difference, 1))

4.4

#### 16. In the database, which all types of communication (`mailer_type`) were used and with how many customers?

In [77]:
print(data.mailer_type.value_counts())

Postcard    9147
Letter      8853
Name: mailer_type, dtype: int64

#### 17. Provide the details of the customer that is the 11th least `Q1_balance` in your database.

In [80]:
query = '''SELECT * 
FROM
(SELECT *,
DENSE_RANK() OVER(ORDER BY balance_Q1 ASC) AS Q1_balance_ranking
FROM credit_card_data) AS ranked_data
WHERE Q1_balance_ranking = 11;
'''

customer_info = pd.read_sql_query(query, engine)
print(customer_info) # There are multiple customers with the 11th least Q1 balance

2022-04-02 17:02:52,197 INFO sqlalchemy.engine.Engine SELECT *
FROM
(SELECT *,
DENSE_RANK() OVER(ORDER BY balance_Q1 ASC) AS Q1_balance_ranking
FROM credit_card_data) AS ranked_data
WHERE Q1_balance_ranking = 11;

2022-04-02 17:02:52,198 INFO sqlalchemy.engine.Engine [raw sql] {}
   customer_number offer_accepted     reward mailer_type income_level  \
0            12905            Yes     Points    Postcard          Low
1            16031             No  Air Miles      Letter          Low
2             3542             No     Points    Postcard       Medium

   bank_accounts_open overdraft_protection credit_rating  credit_cards_held  \
0                   1                   No           Low                  1
1                   1                   No          High                  2
2                   2                   No        Medium                  3

   homes_owned  household_size home_owner  average_balance  balance_Q1  \
0            1               2        Yes           124.25        10.0
1            1               5         No          1058.75        10.0
2            1               1         No           111.50        10.0

   balance_Q2  balance_Q3  Q1_balance_ranking
0        26.0       318.0                  11
1      1184.0      1935.0                  11
2       115.0       286.0                  11